import 'package:flutter/material.dart';

import 'package:flutter_localizations/flutter_localizations.dart';
import 'package:flutter_ui_samples/apps/fitness_magazine/utilities/theme.dart';
import 'package:flutter_ui_samples/apps/fitness_magazine/views/sub_card.dart';

import '../models/main_card.dart';
import '../utilities/color_map.dart';

import 'main_card.dart';

final List<MainCardData> mainCards = [];
final List<MainCardData> subCards = [];

class FitnessPage extends StatefulWidget {
  const FitnessPage({super.key});

  @override
  State<FitnessPage> createState() => _FitnessPageState();
}

class _FitnessPageState extends State<FitnessPage> {
  final List<Locale> appSupportedLocales = const [Locale('ar')];
  bool isDarkMode = false;

  @override
  Widget build(BuildContext context) {
    mainCards.clear();
    subCards.clear();
    addMainCardsData();
    addSubCardsData();
    //print(MediaQuery.of(context).size);
    return MaterialApp(
      title: 'Fitness Magazines',
      debugShowCheckedModeBanner: false,
      localizationsDelegates: const [
        GlobalMaterialLocalizations.delegate,
        GlobalWidgetsLocalizations.delegate,
        GlobalCupertinoLocalizations.delegate,
      ],

      theme: getLightTheme(),
      darkTheme: getDarkTheme(),
      themeMode: isDarkMode ? ThemeMode.dark : ThemeMode.light,
      supportedLocales: appSupportedLocales,
      home: HomePage(
        isDarkMode: isDarkMode,
        switchTheme: () {
          setState(() {
            isDarkMode = !isDarkMode;
          });
        },
      ),
    );
  }
}

class HomePage extends StatelessWidget {
  const HomePage({
    super.key,
    required this.isDarkMode,
    required this.switchTheme,
  });

  final bool isDarkMode;
  final void Function() switchTheme;

  @override
  Widget build(BuildContext context) {
    return DefaultTabController(
      length: 4,
      initialIndex: 0,
      child: Scaffold(
        appBar: AppBar(
          title: Text(
            "مجلة صحية",
            textAlign: TextAlign.center,
            style: TextStyle(color: Colors.white),
          ),
          centerTitle: true,
          actions: [
            IconButton(
              icon: Icon(
                isDarkMode ? Icons.wb_sunny : Icons.nightlight_round_outlined,
                color: Colors.white,
              ),
              onPressed: switchTheme,
            ),
          ],
        ),
        body: Padding(
          padding: const EdgeInsets.all(15.0),
          child: Column(
            mainAxisSize: MainAxisSize.min,
            children: [
              SizedBox(
                height: 400,
                child: ListView.separated(
                  scrollDirection: Axis.horizontal,
                  itemCount: mainCards.length,
                  itemBuilder: (context, index) {
                    return MainCard(
                      mainCardData: mainCards[index],
                      tag: '$index+${mainCards[index].title}',
                    );
                  },
                  separatorBuilder: (context, index) {
                    return SizedBox(width: 10);
                  },
                ),
              ),
              SizedBox(height: 20),
              TabBar(
                indicatorColor: Colors.blueGrey,
                dividerColor: Colors.transparent,
                labelColor: Colors.black,
                labelPadding: EdgeInsets.only(bottom: 6),
                unselectedLabelColor: Colors.white,
                tabs: [
                  createTabBerText('تغذية'),
                  createTabBerText('صحة'),
                  createTabBerText('جمال'),
                  createTabBerText('لياقة'),
                ],
              ),
              Expanded(
                child: TabBarView(
                  children: [
                    createSubCardWidget("تغذية"),
                    createSubCardWidget("صحة"),
                    createSubCardWidget("جمال"),
                    createSubCardWidget("لياقة"),
                  ],
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }

  Widget createTabBerText(String text) {
    return Container(
      alignment: Alignment.center,
      width: 90,
      height: 50,

      decoration: BoxDecoration(
        borderRadius: BorderRadius.circular(50),
        color: getCategoryColor(text),
      ),
      child: Text(text, style: TextStyle(fontSize: 19, fontFamily: 'Somar')),
    );
  }

  Widget createSubCardWidget(String category) {
    List<MainCardData> filteredCards = filterCardsByCategory(category);
    return ListView.separated(
      itemCount: filteredCards.length,
      itemBuilder: (context, index) {
        return SizedBox(
          height: 140,
          child: SubCard(
            mainCardData: filteredCards[index],
            tag: '$index+${filteredCards[index].category}',
          ),
        );
      },
      separatorBuilder: (context, index) {
        return SizedBox(width: 10);
      },
    );
  }
}

List<MainCardData> filterCardsByCategory(String category) {
  return subCards.where((card) => card.category == category).toList();
}

void addMainCardsData() {
  mainCards.add(
    MainCardData(
      category: 'تغذية',
      content: createLongTexts(1)!,
      imageUrl:
          'https://media.istockphoto.com/id/1210634323/photo/avocado-on-old-wooden-table-in-bowl.webp?a=1&b=1&s=612x612&w=0&k=20&c=ZQLXFhn0WVdOLBNQGU6RqkusJRUWsNg_JVAL2JFI0_E=',
      title: '10 فوائد مذهلة لزيت الأفوكادو',
    ),
  );

  mainCards.add(
    MainCardData(
      category: 'صحة',
      content: createLongTexts(2)!,
      imageUrl:
          'https://images.unsplash.com/photo-1670192117184-d07467e203b3?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8JUQ5JTgxJUQ5JTgyJUQ4JUIxJTIwJUQ4JUE3JUQ5JTg0JUQ4JUFGJUQ5JTg1fGVufDB8fDB8fHww',
      title: 'فقر الدم .. الأسباب، الأعراض،',
    ),
  );

  mainCards.add(
    MainCardData(
      category: 'لياقة',
      content: createLongTexts(3)!,
      imageUrl:
          'https://media.istockphoto.com/id/1149241593/photo/man-doing-cross-training-exercise-with-rope.webp?a=1&b=1&s=612x612&w=0&k=20&c=IjKWG-7_43sRh-cPC0reJMXgtgb9L_g4uAHWZa_p7TA=',
      title: '5 تمارين لانقاص الوزن',
    ),
  );

  mainCards.add(
    MainCardData(
      category: 'جمال',
      content: createLongTexts(4)!,
      imageUrl:
          'https://vid.alarabiya.net/images/2020/01/06/3cffc2ac-a0a8-464c-bc21-833a26c4d808/3cffc2ac-a0a8-464c-bc21-833a26c4d808.jpg?crop=1:1&width=1000',
      title: 'فوائد الزنجبيل المطحون للشعر',
    ),
  );
}

void addSubCardsData() {
  subCards.add(
    MainCardData(
      category: 'تغذية',
      content: createLongTexts(1)!,
      title: '10 فوائد مذهلة لزيت الأفوكادو',
      imageUrl:
          'https://media.istockphoto.com/id/1210634323/photo/avocado-on-old-wooden-table-in-bowl.webp?a=1&b=1&s=612x612&w=0&k=20&c=ZQLXFhn0WVdOLBNQGU6RqkusJRUWsNg_JVAL2JFI0_E=',
    ),
  );
  subCards.add(
    MainCardData(
      category: 'تغذية',
      title: 'فوائد الميرمية',
      content:
          '''الميرميّة هي عبارة عن نبات أو عشبة تنتمي للعائلة الشفويّة (النعناع) بجانب الأعشاب الأخرى مثل الخُزامى، وإكليل الجبل، والريحان، وهي شُجيرة دائمة الخضرة ومُعمّرة، أوراقها مُتوسّطة الحجم ورماديّة اللون، وسيقانها خشبيّة صَغيرة، وتستمدّ اسمها
      ''',
      imageUrl:
          'https://images.unsplash.com/photo-1606841634219-d7dbdd97b1ec?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8N3x8U2FnZXxlbnwwfHwwfHx8MA%3D%3D',
    ),
  );

  subCards.add(
    MainCardData(
      category: 'صحة',
      title: 'فقر الدم .. الأسباب، الأعراض',
      content: createLongTexts(2)!,
      imageUrl:
          'https://images.unsplash.com/photo-1670192117184-d07467e203b3?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8JUQ5JTgxJUQ5JTgyJUQ4JUIxJTIwJUQ4JUE3JUQ5JTg0JUQ4JUFGJUQ5JTg1fGVufDB8fDB8fHww',
    ),
  );

  subCards.add(
    MainCardData(
      category: 'جمال',
      title: 'فوائد الزنجبيل المطحون للشعر',
      content: createLongTexts(4)!,
      imageUrl:
          'https://vid.alarabiya.net/images/2020/01/06/3cffc2ac-a0a8-464c-bc21-833a26c4d808/3cffc2ac-a0a8-464c-bc21-833a26c4d808.jpg?crop=1:1&width=1000',
    ),
  );

  subCards.add(
    MainCardData(
      category: 'لياقة',
      content: createLongTexts(3)!,
      title: '5 تمارين لانقاص الوزن',
      imageUrl:
          'https://media.istockphoto.com/id/1149241593/photo/man-doing-cross-training-exercise-with-rope.webp?a=1&b=1&s=612x612&w=0&k=20&c=IjKWG-7_43sRh-cPC0reJMXgtgb9L_g4uAHWZa_p7TA=',
    ),
  );

  subCards.add(
    MainCardData(
      category: 'صحة',
      title: 'مرض السل',
      content:
          '''السُل مرض معدٍ خطير يُصيب الرئتين في الأساس. تنتقل البكتيريا التي تتسبَّب في الإصابة بمرض السُل من شخص إلى آخر من خلال الرذاذ الذي يخرج في الهواء عبر السعال والعطس.

بعدما كان هذا المرض نادرًا في البلدان النامية، بدأت حالات عدوى السُّل في التزايد في عام 1985 ، ويرجع ذلك -إلى حد م
      ''',
      imageUrl:
          'https://plus.unsplash.com/premium_photo-1718955640503-2e26751bf9ab?q=80&w=1632&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    ),
  );
}

String? createLongTexts(int number) {
  switch (number) {
    case 1:
      return '''
يعتبر زيت الأفوكادو أحد مضادات الأكسدة القوية مع العديد من الفوائد مثل تعزيز فقدان الوزن وصحة القلب. وان استبداله بالزيت العادي يمكن أن يفعل المعجزات.
فزيت الأفوكادو مفيد لصحتك وهو مصدر كبير لفيتامين E وأوميغا 3 وأوميغا 9 والدهون غير المشبعة ومضادات الأكسدة. كما أنه مفيد للبشرة والشعر والعينين والقلب ويساعد في إنقاص الوزن، وفق تقرير نشره موقع «OnlyMyHealth» الصحي المتخصص.
وتشمل أهم الفوائد الصحية لزيت الأفوكادو ما يلي:

1. جيد للقلب

يحتوي زيت الأفوكادو على أحماض دهنية غير مشبعة تساعد في تحسين صحة قلبك؛ حيث يخفض ضغط الدم والكوليسترول السيئ في جسمك، ويزيل السموم، وبالتالي يحمي الأوعية الدموية. إذ يساعد استخدام زيت الأفوكادو في موازنة مستوى الأحماض الدهنية الأساسية في الكلى. بالإضافة إلى ذلك، له خصائص مضادة للالتهابات ما يساعد على منع تلف جدران الشرايين.

2. جيد للبشرة

يعتبر زيت الأفوكادو مصدرًا جيدًا لمضادات الأكسدة مثل بيتا كاروتين والبروتين واللوتين وفيتامين (ه)؛ فهو يساعد على تقوية بشرتك ومنع تلفها؛ كما يساعد على تغذية بشرتك ويوفر الحماية من الأشعة فوق البنفسجية الضارة. علاوة على ذلك يعالج الندبات ويمنع التجاعيد ويعزز إنتاج الكولاجين، ما يجعل بشرتك شابة.

3. يعزز نمو الشعر

يحتوي زيت الأفوكادو على فيتامين (ب) وفيتامين (ه)، ما يعزز نمو الشعر ويحافظ على صحة فروة رأسك. كما أنه يقلل من تلف الشعر وتساقطه. فهو يرسل إشارات إلى الغدد الدهنية ويساعد أيضًا في التحكم بإفراز الزيت على فروة الرأس.

4. لفقدان الوزن

يساعد زيت الأفوكادو في إنقاص الوزن لأنه غني بالدهون الأحادية غير المشبعة وحمض الأوليك. حيث يقلل من دهون البطن ويزيد من معدل التمثيل الغذائي في الجسم. فهو يمتص الكاروتينات التي تذوب في الدهون، ما يساعد في إنقاص الوزن.

5. امتصاص العناصر الغذائية

يزيد زيت الأفوكادو من مستوى امتصاص العناصر الغذائية في جسمك بسبب ارتفاع مستوى الدهون الأحادية غير المشبعة الموجودة فيه.

6. جيد للعيون

يعزز زيت الأفوكادو صحة عينيك لأنه غني باللوتين وفيتامين (ه)، ويقلل من خطر الإصابة بإعتام عدسة العين والضمور البقعي.

7. يمنع الانتفاخ

يمكن أن يمنع استهلاك زيت الأفوكادو الانتفاخ لأنه يحسن مستويات الطاقة في الجسم ويعزز الهضم.

8. يساعد في تقليل الالتهابات

زيت الأفوكادو مناسب للأشخاص المصابين بالتهاب المفاصل حيث يساعد في تقليل الالتهاب. كما يقلل من تصلب المفاصل ويمنع أمراض اللثة مثل النزيف.

9. مناسب لعلاج الجروح

يمكن أن يساعد زيت الأفوكادو في التئام جروحك بشكل أسرع. إذ تساعد الأحماض الدهنية الأساسية الموجودة في زيت الأفوكادو على تقليل الالتهاب. كما يمكن استخدامه بعلاج لدغات الحشرات.

10. مفيد في حروق الشمس

زيت الأفوكادو غني بمضادات الأكسدة وفيتامين E وبيتا كاروتين والبروتين الذي يفيد في علاج حروق الشمس وتهدئة البشرة.
ورغم ان زيت الأفوكادو غني بالعناصر الغذائية وله فوائد متعددة، إلا انه يجب تجنب استخدامه إذا كانت لديك حساسية من الزيوت النباتية؛ فقد يؤدي استهلاكه بكميات زائدة إلى حدوث تفاعلات حساسية مثل الاحمرار أو الحكة ومشاكل الجهاز الهضمي وحساسية الفم. كما يجب على الأشخاص الذين يعانون من فرط الحساسية والنساء الحوامل والمرضعات تجنب استخدام زيت الأفوكادو.
''';
    case 2:
      return '''فقر الدم هو حالة شائعة تؤثر على صحة ملايين الأشخاص حول العالم، وتحدث عندما يقل عدد خلايا الدم الحمراء أو مستوى الهيموجلوبين، مما يؤدي إلى نقص الأوكسجين في الجسم. هذا النقص يمكن أن يسبب التعب، الدوخة، والصداع، مما يؤثر على الأنشطة اليومية. في هذا المقال، سنناقش أهم أسباب فقر الدم وأعراضه، وطرق العلاج المتاحة، إضافةً إلى الإجابة على الأسئلة الشائعة حول هذا المرض.

 

ما هو فقر الدم ؟
يُعرف فقر الدم على أنه انخفاض في مستوى الهيموجلوبين أو عدد خلايا الدم الحمراء، مما يقلل من كمية الأوكسجين التي تصل إلى أنسجة الجسم. هذه الحالة يمكن أن تكون مؤقتة أو طويلة الأمد، وتختلف شدتها بناءً على السبب الكامن.

 

كيف أعرف أني أعاني من فقر الدم ؟
يمكنك معرفة إذا كنت تعاني من فقر الدم عبر الأعراض الشائعة مثل الشعور بالتعب المستمر، الصداع المتكرر، وضيق التنفس. لإجراء تشخيص دقيق، يُفضل زيارة الطبيب وإجراء فحص للدم.

 

ماذا يحدث عندما يصاب الشخص بفقر الدم ؟
عند الإصابة بفقر الدم، يعاني الجسم من نقص في الأوكسجين الضروري للأنسجة. هذا قد يؤدي إلى التعب المستمر، الدوخة، وبرودة اليدين والقدمين، وقد يشعر المريض بصعوبة في بذل مجهود بدني بسيط.

 

أنواع فقر الدم .
يوجد عدة أنواع من فقر الدم، منها:

فقر الدم بسبب نقص الحديدالجسم

فقر الدم الناتج عن نقص الفيتامينات

فقر الدم الانحلاليخلايا الدم الحمراء

فقر الدم الحاد

 

متى يعتبر فقر الدم حاد ؟
يُعتبر فقر الدم حادًا إذا كانت مستويات الهيموجلوبين منخفضة جدًا بشكل يؤثر على وظائف الجسم، ويؤدي إلى أعراض شديدة مثل ضيق التنفس والتعب المتواصل. في مثل هذه الحالات، قد يتطلب الأمر تدخلاً سريعًا من الطبيب، وربما حتى نقل دم.

 

أسباب فقر الدم .
تشمل أسباب فقر الدم ما يلي:

نقص الحديد

نقص الفيتامينات

الأمراض المزمنةخلايا الدم الحمراء

أسباب وراثية
    ''';
    case 3:
      return '''يعد فقدان الوزن عنصرًا رئيسيًا في خطة العديد من الأشخاص لتحسين صحتهم. لكن التخلص من الأرطال والحفاظ عليها ليس بالأمر السهل. أو سريع.

اتباع نظام غذائي نهج جيد (لكننا سنتطرق إلى ذلك في قصة أخرى). المسار الآخر هو التمرين. إليك خمسة تمارين رائعة تساعدك على إنقاص بضعة أرطال والحفاظ على صحتك.

حتى واحد الذي هو أفضل؟ حسنًا ، إنه التمرين الذي لا تخشاه وترغب في الالتزام به. لا يجب أن يكون دائمًا عملاً روتينيًا. الاتساق هو المفتاح. ويمكن أن يؤدي خلط العديد من هذه العناصر في روتين التمرين إلى كسر الرتابة.

المشي
إنها مريحة ورائعة للمبتدئين ، ويمكن إجراؤها في أي مكان ، ولا تتطلب أي معدات ولا تضع الكثير من الضغط على مفاصلك.

حاول المشي لمدة 30 دقيقة 3-4 مرات كل أسبوع. يمكنك زيادة عدد مرات المشي أو مدتها تدريجيًا حيث يصبح جسمك أكثر لياقة.

الركض / الجري
ما الفرق ، تسأل؟ الركض هو سرعة تتراوح بين 4-6 ميل في الساعة ، بينما الجري أسرع من ذلك. مهما كانت وتيرتك ، فقد وجد أن كلاهما يحرق الدهون الحشوية (المعروفة باسم دهون البطن) ، والتي ترتبط بأمراض القلب والسكري.

للبدء ، حاول الهرولة لمدة 20-30 دقيقة 3-4 مرات في الأسبوع.

إذا كان الأسمنت أو أي سطح صلب قاسيًا على مفاصلك ، فحاول التبديل إلى الجري على العشب. تعتبر المطاحن المزودة بوسادة مدمجة خيارًا جيدًا آخر

تدريب الوزن
انتظر ، ألا يؤدي بناء العضلات إلى زيادة الوزن؟ لا ، العكس تماما! يمكن أن يؤدي بناء قوتك ونمو عضلاتك إلى زيادة معدل الأيض أثناء الراحة ، وهو عدد السعرات الحرارية التي يحرقها جسمك أثناء الراحة.

أظهرت دراسات أخرى أنك ستستمر في حرق السعرات الحرارية بعد عدة ساعات من تمارين رفع الأثقال مقارنة بالتمارين الهوائية. تساعد تمارين الوزن أيضًا على الوقاية من هشاشة العظام.

ركوب الدراجات
يمكنك ركوب الدراجة في الهواء الطلق أو في الداخل حيث توفر العديد من الصالات الرياضية ومراكز اللياقة البدنية دراجات ثابتة. إنه تمرين قوي للمبتدئين حتى الرياضيين المتفانين. ركوب الدراجات لا يحمل الوزن ، لذلك ستشكرك مفاصلك بعد ذلك أيضًا.

كشفت الدراسات أن الأشخاص الذين يركبون الدراجات بانتظام قد ارتبطوا بانخفاض نسبة السكر في الدم ، وانخفاض خطر الإصابة بالسرطان وأمراض القلب والوفاة مقارنة بالأشخاص الذين ليسوا راكبي دراجات منتظمين.

سباحة
إنه تمرين منخفض التأثير للجسم بالكامل ، مما يعني أنه سيكون أسهل على مفاصلك. هذا يجعله خيارًا جذابًا إذا كنت تتعافى من إصابة أو إذا كنت تتعامل مع آلام المفاصل.

ستحدد السكتة الدماغية التي تختارها ومدة السباحة عدد السعرات الحرارية التي تحرقها. ولكن يمكن أن تكون طريقة ممتعة لممارسة الرياضة ويمكن أن تحسن مرونتك وتقليل عوامل خطر الإصابة بأمراض القلب. تذكر أن السباحة تجمع بين تمارين الكارديو وتمارين القوة ، حيث يضيف الماء عنصر مقاومة ويجبرك على استخدام العضلات بشكل أكثر كفاءة.

كم عدد السعرات الحرارية التي سأحرقها بالفعل؟

في ساعة واحدة من التمرين ، يحترق الشخص الذي يزن 160 رطلاً تقريبًا:
التمارين الرياضية (تأثير منخفض) – 365 سعرة حرارية
أيروبيكس ، ماء: 402 سعرة حرارية
ركوب الدراجات ، أقل من 10 ميل في الساعة – 292 سعرة حرارية
الجري بسرعة 5 أميال في الساعة – 606 سعرة حرارية
السباحة ، خفيف إلى معتدل: 403 سعرات حرارية
المشي ، 3.5 ميل في الساعة – 314 سعرة حرارية
تحرك. راحة. يكرر. ستكون في طريقك لفقدان الوزن وتحسين صحتك.
    ''';
    case 4:
      return '''يعتبر الزنجبيل واحد من أهم التوابل المستخدمة في المطابخ حول العالم، إمّا بشكله الطازج أو على شكل مسحوق ناعم، حيث إنّه يحتوي على العديد من المواد والعناصر الغذائية المفيدة للصحة. إلّا أن فوائده لا تقتصر على ذلك، حيث أنه يتمتّع بفوائد جمالية أيضاً. من هنا، سنسلّط الضوء على فوائد الزنجبيل للشعر وطرق تحضير خلطات منه.

فوائد الزنجبيل للشعر
1- علاج الشيب المبكر
يعدّ الزنجبيل من أهم الأعشاب المستخدمة للتخلص من الشعر الأبيض وتأخير ظهوره وذلك لاحتوائه على الفيتامينات، الأحماض، الحديد واليود، التي بدورها تحفز الجسم على الاستمرارية في إنتاج صبغ الميلانين.

2- علاج الشعر المتقصف
يتعرّض الشعر للإصابة بحالات التقصّف والتلف. من هنا، فإن الزنجبيل يساعد على علاج التقصف.

3- تكثيف وتطويل الشعر
من أهم فوائد الزنجبيل للشعر أنه يعمل على تنشيط الدورة الدموية لفروة الرأس مما يؤدي لتدفق الدم إليها بشكل أفضل، كما أنه يحفز نمو بصيلات الشعر مما يعمل على تكثيفه.

4- منع تساقط الشعر
يعمل الزنجبيل على تغذية بصيلات الشعر مما يجعلها قوية. كما يمنع الزنجبيل تساقط الشعر تماماً، وذلك نتيجة احتوائه على العديد من العناصر الضرورية لصحة الشعر كالبوتاسيوم والمغنيسيوم والفسفور والفيتامينات وغيرها.

5- علاج جفاف الشعر
يتميّز الزنجبيل بأنه غني بالفيتامينات والمعادن كالزنك والفوسفور الضرورية لصحة الشعر، وبإمكانه أن يغذّي شعرك ويخلصه من الجفاف.

6- علاج قشرة الشعر
يساعد الزنجبيل في حلّ مشكلة قشرة الشعر وذلك لأن له خصائص مطهرة طبيعية تجعله عنصر مثالي للتخلص من قشرة الرأس.

خلطات للشعر من الزنجبيل
1- زيت السمسم وزيت الزنجبيل من أجل علاج الشيب المبكر
المكوّنات:

10 ملاعق من زيت السمسم
1/2 ملعقة من زيت الزنجبيل
1/2 ملعقة من زيت الخزامى
طريقة التحضير:

امزجي جميع المكونات الى أن تتحول هذه الزيوت الى مزيج متماسك.
طبّقي المزيج على فروة رأسك وشعرك من الجذور حتى الأطراف.
اتركي المزيج على الشعر لمدة 20 دقيقة واغسلي الشعر جيدًا بالشامبو المناسب.
2- خلطة الزنجبيل والقهوة من أجل علاج الشعر المتقصف
المكوّنات:

5 ملاعق صغيرة من رواسب القهوة المشروبة
ملعقة صغيرة من زيت الخروع
ملعقة صغيرة من زيت الأرغان
ملعقة صغيرة من زيت اللوز الحلو
ملعقة صغيرة من الزنجبيل
طريقة التحضير:

قومي بتطبيق الخلطة على فروة الرأس فقط ودلكّي الرأس لمدة 5 دقائق بهذه الخلطة.
غطّي الرأس بالغطاء البلاستيكي المخصص للشعر لمدة ساعتين، ثم اغسلي الشعر بعد المدة المحددة بالماء.
يمكنك استخدام كوب من خل التفاح ووضعه في كوب من الماء ثم إضافته إلى الشعر للتخلص من آثار وبقايا القهوة. إغسلي شعرك بعدها بالشامبو المخصص لنوع شعركِ.
3- خلطة الزنجبيل وزيت الجوجوبا من أجل تكثيف الشعر
المكوّنات:

ملعقة صغيرة من الزنجبيل الطازج المبشور.
ملعقة كبيرة من زيت الجوجوبا.
طريقة التطبيق:

ضعي المكونات السابقة في وعاء مناسب واخلطيهما جيداً.
ضعي الخليط الناتج عنهما على شعركِ وفروة رأسكِ.
دلكي فروة رأسكِ بلطف لبضع دقائق.
اتركي الخليط على شعركِ لمدة نصف ساعة على الأقل.
اغسلي شعركِ بعد انتهاء المدة بالماء والشامبو الذي يناسبكِ وتأكدي من إزالة بقايا الخليط جيداً من شعركِ.
4- خلطة الزنجبيل وزيت الزيتون من أجل تطويل الشعر
المكوّنات:

ملعقة كبيرة من مسحوق الزنجبيل.
3 ملاعق كبيرة من زيت الزيتون.
طريقة التطبيق:

قومي بتدفئة زيت الزيتون قليلاً.
ضعي الزيت المدفأ مع مسحوق الزنجبيل في وعاء مناسب واخلطيهما سويا حتى يمتزجا جيداً.
اتركي المزيج جانباً لمدة نصف ساعة.
وزعّي الخليط على شعركِ وفروة رأسكِ، وقومي بتدليك فروة رأسكِ بلطف لبضع دقائق.
اتركي الخليط على شعركِ لمدة تتراوح من 25 إلى 30 دقيقة.
اغسلي شعركِ بعد مرور الوقت المحدد بالماء الدافئ والشامبو المناسب لشعركِ.
5- خلطة الزنجبيل وزيت الزيتون من أجل علاج القشرة
المكوّنات:

ملعقتان كبيرتان من الزنجبيل المطحون
3 ملاعق صغيرة من زيت الزيتون
1/2 ملعقة كبيرة من عصير الليمون
طريقة التحضير:

امزجي المكونات مع بعضها البعض.
طبّقي المزيج على شعرك وفروة رأسك، واتركيه لمدة 1/2 ساعة.
اغسلي شعرك بالشامبو والماء.
6- خلطة الزنجبيل والثوم من أجل علاج القشرة
المكوّنات:

ملعقة كبيرة من الزنجبيل المبشور
فص من الثوم المهروس
طريقة التحضير:

اخلطي المكونات مع بعضها البعض من ثم طبقيّ الخليط على شعرك من جذوره وحتى أطرافه، مع تدليك فروة الرأس بأطراف أصابعك.
اتركي الخليط على شعرك لمدة 30 دقيقة، ومن ثم اغسلي شعرك بالشامبو والماء جيّداً.
هذه الخلطة تغذّي الشعر وتقوّيه، تقضي على القشرة، وتعالج الحكة التي تصيب فروة الرأس.
    
    ''';
  }
}
